tutorials/combustion/dieselFoam/aachenBomb/constant/injectorProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      injectorProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    {
        injectorType        unitInjector;

        unitInjectorProps
        {
            position        (0 0.0995 0);
            direction       (0 -1 0);
            diameter        0.00019;
            Cd              0.9;
//             mass            6e-06;
//             nParcels        5000;

            mass            2e-06;
            nParcels        15000;

            X
            (
                1.0
            );

            massFlowRateProfile
            (
                (0 0.1272)
                (4.16667e-05 6.1634)
                (8.33333e-05 9.4778)
                (0.000125 9.5806)
                (0.000166667 9.4184)
                (0.000208333 9.0926)
                (0.00025 8.7011)
                (0.000291667 8.2239)
                (0.000333333 8.0401)
                (0.000375 8.845)
                (0.000416667 8.9174)
                (0.000458333 8.8688)
                (0.0005 8.8882)
                (0.000541667 8.6923)
                (0.000583333 8.0014)
                (0.000625 7.2582)
                (0.000666667 7.2757)
                (0.000708333 6.968)
                (0.00075 6.7608)
                (0.000791667 6.6502)
                (0.000833333 6.7695)
                (0.000875 5.5774)
                (0.000916667 4.8649)
                (0.000958333 5.0805)
                (0.001 4.9547)
                (0.00104167 4.5613)
                (0.00108333 4.4536)
                (0.001125 5.2651)
                (0.00116667 5.256)
                (0.00120833 5.1737)
                (0.00125 3.9213)
            );

            temperatureProfile
            (
                (0.0      320.0)
                (0.00125  320.0)
            );

        }

        commonRailInjectorProps
        {
            position            (0 0.0995 0);
            direction           (0 -1 0);
            diameter            0.00019;
            mass                6e-06;
            injectionPressure   200.0e+5;
            temperature         320;
            nParcels            5000;

            X
            (
                1.0
            );

            massFlowRateProfile
            (
                (0 0.1272)
                (4.16667e-05 6.1634)
                (8.33333e-05 9.4778)
                (0.000125 9.5806)
                (0.000166667 9.4184)
                (0.000208333 9.0926)
                (0.00025 8.7011)
                (0.000291667 8.2239)
                (0.000333333 8.0401)
                (0.000375 8.845)
                (0.000416667 8.9174)
                (0.000458333 8.8688)
                (0.0005 8.8882)
                (0.000541667 8.6923)
                (0.000583333 8.0014)
                (0.000625 7.2582)
                (0.000666667 7.2757)
                (0.000708333 6.968)
                (0.00075 6.7608)
                (0.000791667 6.6502)
                (0.000833333 6.7695)
                (0.000875 5.5774)
                (0.000916667 4.8649)
                (0.000958333 5.0805)
                (0.001 4.9547)
                (0.00104167 4.5613)
                (0.00108333 4.4536)
                (0.001125 5.2651)
                (0.00116667 5.256)
                (0.00120833 5.1737)
                (0.00125 3.9213)
            );

            injectionPressureProfile
            (
                (0.0        1.0)
                (0.00125    1.0)
            );
        }
    }
)


// ************************************************************************* //
